{
  "hero_title": "Passkey is the future of online identities.",
  "hero_p1": "With passkey, you can create and login to your account with ease. No need to set, remember or input complex passwords, just click and you are all set.",
  "hero_p2": "For server-side, it also have multiple open-sourced libraries across different platforms and programming languages to help you to intergrate it to your website. It possibile that done it in one day by one developer.",
  "hero_btn": "Give it a try!",
  "sec1_title": "Interactive Experience",
  "sec1_tab_reg": "Register",
  "sec1_tab_login": "Log in",
  "sec1_creacc_btn": "Create Account",
  "sec1_anote_p1": "Use your browser profile, FIDO USB key, phone or supported password manager to create your account.",
  "sec1_anote_p2": "Only lowercase letters, numbers and period are vaild.",
  "sec1_login_btn": "Log in",
  "sec1_login_ante": "Yes, even the username is not necessary!",
  "sec2_title": "Frequent Asked Questions",
  "sec2_q1": "What is passkey?",
  "sec2_a1": "Passkey is an alternative authentication method to verify your identity. Compared to passwords, it is simple and easy to use and has exceptionally high security. You already have a passkey-enabled device if you have an iPhone (iOS 15 or higher) or an Android smartphone (Google Play Services supported).",
  "sec2_q2": "What can I experience in this demo?",
  "sec2_a2_p": "You can create an account, log in and manage your account with passkey. Specifically:",
  "sec2_a2_l1": "Register with passkeys",
  "sec2_a2_l2": "One-click log-in experience (no username needed)",
  "sec2_a2_l3": "Adding and managing multiple passkeys with your account",
  "sec2_q3": "Is it secure?",
  "sec2_a3_p1": "In a nutshell, a passkey is combined with two parts: a private key (held by you) and a public key (held by the server). When you log in to a website, the server will send the login challenge with the public key, which can only be resolved by the private key owner. Throughout the process, the private key is always kept in your hand.",
  "sec2_a3_p2": "Hackers can do nothing throughout the process, including guessing the private key with the public key which can be fetched public if the public key has leaked, fetching your private key if your network is bugged, or faking a challenge to cheat the server. That is why a passkey is considered a great alternative to a password.",
  "sec2_a3_p3": "However, cyber security is a massive project for everyone, no matter who you are. The passkey is only part of security, so make sure you have a good habit of using the internet.",
  "sec2_q4": "Is, it, secure - give me a tl;dr!",
  "sec2_a4": "The passkey is not secure for you if you cannot keep your passkey secure. The basic requirement for using a passkey to secure your account is that you secure your USB key or phone, which includes your passkeys, by a strong PIN.",
  "sec2_q5": "Which services support passkey?",
  "sec2_a5": "The 1Password team is maintaining a list of all service support passkeys. <0>See here</0>.",
  "sec2_q6": "How can I use passkey if the website supports it?",
  "sec2_a6": "The easiest way to add a passkey to your account is to use your browser profile or the credential manager provided by your operating system. However, you can also put your passkey on your FIDO-enabled USB key or supported password managers. In most cases, the USB key or password manager can help you use your passkey across different devices.",
  "sec2_q7": "Can passkey be used if a website does not support it directly?",
  "sec2_a7_p1": "If this website has a 2-factor authentication option called “hardware USB key,” you can use a passkey to replace the actual hardware USB key in most cases. In practice, Mastodon, Fastmail, Twitter (X), Cloudflare, Facebook, and AWS have supported the use of a passkey as a 2-factor authentication.",
  "sec2_a7_p2": "The only downside is you cannot remove your account password, and you still need to input it each time you log in. However, using a passkey to alternate TOTP or SMS code can improve the security level of your account.",
  "sec2_q8": "How can I integrate passkey into my website?",
  "sec2_a8_p1": "In most cases, using an open-source library is encouraged. For the frequent changes of WebAuthn, the fundamental technology of passkey, the open-source library can help you make the integrated process more straightforward, and you can avoid most security exposures.",
  "sec2_a8_p2": "For Node.js, you can add passkey support with <0>@simplewebauthn</0> (used by this project!). There are also many other libraries for different programming languages.",
  "sec2_q9": "How about app deveopers?",
  "sec2_a9": "Apple and Google have their own guidance for supporting passkeys in your app. You can let users use the same passkey across the app and the web. For more information, check out the <0>Apple Developer Portal</0> and <1>Google Developer website</1>",
  "footer_p1": "Develop by <0>Astrian</0> with love.",
  "footer_p2": "Sourcecode",
  "passkeylist_revoke_btn": "Revoke",
  "passkeylist_cgaot_btn": "Change annotate",
  "passkeylist_title": "My passkeys",
  "passkeylist_new_btn": "Assign a passkey",
  "passkeylist_default_name": "Passkey",
  "passkeylist_createdat": "Create at",
  "passkeylist_lastusedat": "Last used at",
  "passkeylist_confirmrevoke": "You will no longer be able to log in with this passkey. The passkey on device will remain and you need to remove it manually.",
  "passkeylist_changeannotate": "Change annotate for this passkey to help you distinguish:",
  "passkeylist_changeannotate_empty": "Passkey annotate cannot be empty."
}